ERP DEV.WMS/src/DataProcessors/вмс_КабинетПоклажедателя/вмс_КабинетПоклажедателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>вмс_КабинетПоклажедателя</name>
</mdclass:DataProcessor>

ERP DEV.WMS/src/InformationRegisters/вмс_ТоварыПоклажедателей/вмс_ТоварыПоклажедателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_ТоварыПоклажедателей</name>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/DataProcessors/вмс_КабинетПоклажедателя/Forms/ФормаЗагрузкиТоваровИзЕксель/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОрганизацияПоУмолчанию = Справочники.Организации.ОрганизацияПоУмолчанию();
	Если Не ОрганизацияПоУмолчанию.Пустая() Тогда	
		Организация = ОрганизацияПоУмолчанию;		
	    Элементы.Организация.Видимость = Ложь;	
	КонецЕсли;   
	
	Если Параметры.ТаблицаПриемник = "ВозвратТоваров" Тогда   
		СоздатьКолонкуКоличество();
	КонецЕсли;  
	
КонецПроцедуры 

&НаСервере
Процедура СоздатьКолонкуКоличество()
	
	Элементы.Декорация2.Заголовок = "ВАЖНО! В таблицу будут перенесены только те товары, остатки которых есть у хранителя!";
	ТабличныйДокумент.Область(1,4).Текст = "Количество";   
	ТабличныйДокумент.Область(1,4).ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
	ТабличныйДокумент.Область(1,4).ВертикальноеПоложение = ВертикальноеПоложение.Центр;   
	ШрифтТекста = Новый Шрифт(,,10, Истина);
	ТабличныйДокумент.Область(1,4).Шрифт = ШрифтТекста;        
	ТабличныйДокумент.Область(1,4).ШиринаКолонки = 18;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если ПроверитьЗаполнение() Тогда 
		СтруктураЗагружаемыхТоваров = Новый Структура; 
		Предел = 2; 
		
		//ТУ_Кошелев 09.01.25 - ДанныеКорректны инициализация по умолчанию; проверка на пустую таблицу вынесена наверх в блоке "Если"
		ДанныеКорректны = Ложь;
		
		Пока Предел <= ТабличныйДокумент.ВысотаТаблицы Цикл 
			Товар = Новый Структура("Организация,Контрагент, Артикул, Товар, Штрихкод",Параметры.Организация, Параметры.Контрагент, ТабличныйДокумент.Область(Предел,1).Текст,СокрЛП(ТабличныйДокумент.Область(Предел,2).Текст),ТабличныйДокумент.Область(Предел,3).Текст); 
	        ДанныеКорректны = Истина;

			Если Параметры.ТаблицаПриемник = "ВозвратТоваров" Тогда 
				Попытка	
					ЧислоВЕксель = Число(СокрЛП(ТабличныйДокумент.Область(Предел,4).Текст));	
				Исключение
					ДанныеКорректны = Ложь;	  
					Прервать;
				КонецПопытки;
				Товар.Вставить("Количество",ЧислоВЕксель); 
			КонецЕсли;

			СтруктураЗагружаемыхТоваров.Вставить("Товар"+(Формат(Предел-1, "ЧГ=")),Товар); 		
			Предел = Предел+1;
		КонецЦикла;	
		
		Если СтруктураЗагружаемыхТоваров.Количество() = 0 Тогда		
			ПоказатьПредупреждение(,"Добавьте товар в табличную часть!");
		ИначеЕсли НЕ ДанныеКорректны Тогда		
			ПоказатьПредупреждение(,"Некорректно заполнены данные в табличном документе! Проверьте корректность ввода данных!");
		Иначе
			ГотовыеДанные = ОбработатьЗагружаемыйТовар(СтруктураЗагружаемыхТоваров);	
			Закрыть(ГотовыеДанные);		
		КонецЕсли;
	КонецЕсли;  
	
КонецПроцедуры  
	
&НаСервере
Функция ОбработатьЗагружаемыйТовар(ТоварыКЗагрузке)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивОбработанныхТоваров = Новый Массив; 
	МассивНеОбработанныхТоваров = Новый Массив;  
	
	Для каждого Строка Из ТоварыКЗагрузке Цикл    
		СтруктураТовара = Новый Структура("Номенклатура, Количество, КоличествоНаОстатках");
		Значение = Строка.Значение;  
		Если ЗначениеЗаполнено(Значение.Товар) Тогда
			НаименованиеТовара = Строка(Параметры.Контрагент) +"_"+Значение.Товар;
			НайденныйТовар = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеТовара);  
			Если Параметры.ТаблицаПриемник = "СдатьНаХранение" Тогда
				
				Если ЗначениеЗаполнено(НайденныйТовар) Тогда	
					СтруктураТовара.Номенклатура = НайденныйТовар.Ссылка;
				Иначе
					НовыйТовар = ВМС_ЛичныйКабинетПоклажедателяВызовСервер.СоздатьТоварПоклажедателя(Значение);  
					ЗаполнитьЗначенияСвойств(СтруктураТовара, НовыйТовар);
				КонецЕсли;
				МассивОбработанныхТоваров.Добавить(СтруктураТовара);
			ИначеЕсли  Параметры.ТаблицаПриемник = "ВозвратТоваров" Тогда
				Если ЗначениеЗаполнено(НайденныйТовар) Тогда	
					ЗаполнитьЗначенияСвойств(СтруктураТовара,ПроверитьНаличиеТовараУХранителя(НайденныйТовар, Значение.Количество));	
					МассивОбработанныхТоваров.Добавить(СтруктураТовара);
				Иначе
					МассивНеОбработанныхТоваров.Добавить(СокрЛП(Значение.Товар));
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;			
	СтруктураДанных = Новый Структура("МассивОбработанныхТоваров, МассивНеОбработанныхТоваров", МассивОбработанныхТоваров, МассивНеОбработанныхТоваров);
	Возврат СтруктураДанных;  
	
КонецФункции // ОбработатьЗагружаемыйТовар()

&НаСервере
Функция ПроверитьНаличиеТовараУХранителя(НайденныйТовар, КоличествоКЗагрузке)
	
	УстановитьПривилегированныйРежим(Истина);
	
	лТекст = "
	|ВЫБРАТЬ
	|	вмс_ТоварыПоклажедателей.Товар КАК Товар,
	|	вмс_ТоварыПоклажедателей.Контрагент КАК Контрагент,
	|	вмс_ТоварыПоклажедателей.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ТоварыПоклажедателя
	|ИЗ
	|	РегистрСведений.вмс_ТоварыПоклажедателей КАК вмс_ТоварыПоклажедателей
	|ГДЕ
	|	вмс_ТоварыПоклажедателей.Контрагент = &Контрагент
	|	И вмс_ТоварыПоклажедателей.Организация = &Организация
	|	И вмс_ТоварыПоклажедателей.Товар = &Товар
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ТоварыОрганизацийОстатки.Организация, ВТ_ТоварыПоклажедателя.Организация) КАК Организация,
	|	ЕСТЬNULL(ТоварыОрганизацийОстатки.КоличествоОстаток, 0) КАК КоличествоНаОстатках,
	|	ЕСТЬNULL(ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура, ВТ_ТоварыПоклажедателя.Товар) КАК Номенклатура
	|ИЗ
	|	ВТ_ТоварыПоклажедателя КАК ВТ_ТоварыПоклажедателя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(
	|				,
	|				(АналитикаУчетаНоменклатуры.Номенклатура, Организация) В
	|					(ВЫБРАТЬ
	|						ВТ_ТоварыПоклажедателя.Товар КАК Товар,
	|						ВТ_ТоварыПоклажедателя.Организация КАК Организация
	|					ИЗ
	|						ВТ_ТоварыПоклажедателя КАК ВТ_ТоварыПоклажедателя)) КАК ТоварыОрганизацийОстатки
	|		ПО ВТ_ТоварыПоклажедателя.Товар = ТоварыОрганизацийОстатки.АналитикаУчетаНоменклатуры.Номенклатура
	|			И ВТ_ТоварыПоклажедателя.Организация = ТоварыОрганизацийОстатки.Организация
	|";
	лЗапрос = Новый Запрос(лТекст);
	лЗапрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	// Установка параметров.
	лЗапрос.УстановитьПараметр("Контрагент", Параметры.Контрагент);
	лЗапрос.УстановитьПараметр("Организация", Параметры.Организация);
	лЗапрос.УстановитьПараметр("Товар", НайденныйТовар);

    ДанныеОТоваре = Новый Структура("Номенклатура, Количество, КоличествоНаОстатках");
	
	РезультатЗапроса = лЗапрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();     
	ЗаполнитьЗначенияСвойств(ДанныеОТоваре, Выборка); 
	
	ДанныеОТоваре.Количество = КоличествоКЗагрузке;
	
	Возврат ДанныеОТоваре;

КонецФункции // ПроверитьНаличиеТовараУХранителя()
